{
  "_class_name": "LongCatVideoTransformer3DModel",
  "_diffusers_version": "0.31.0",
  
  "comment_architecture": "LongCat Transformer3D 架构参数",
  "in_channels": 16,
  "out_channels": 16,
  "hidden_size": 4096,
  "depth": 48,
  "num_heads": 32,
  "caption_channels": 4096,
  "mlp_ratio": 4,
  "adaln_tembed_dim": 512,
  "frequency_embedding_size": 256,
  "patch_size": [1, 2, 2],
  
  "comment_attention_backends": "注意力后端配置 - 只能启用一个",
  "enable_flashattn3": false,
  "enable_flashattn2": true,
  "enable_xformers": false,
  
  "comment_bsa": "==== BSA (Block Sparse Attention) 配置 ====",
  "comment_bsa_note": "建议在 720p 及以上分辨率时启用 BSA",
  "enable_bsa": true,
  "bsa_params": {
    "comment_sparsity": "稀疏度: 0.9375 表示只保留 6.25% 的注意力",
    "sparsity": 0.9375,
    
    "comment_cdf_threshold": "CDF 阈值: null 表示不使用，可设置为 0.95-0.98 使用自适应选择",
    "cdf_threshold": null,
    
    "comment_chunk_shapes": "3D 块形状 [时间, 高度, 宽度]",
    "chunk_3d_shape_q": [4, 4, 4],
    "chunk_3d_shape_k": [4, 4, 4]
  },
  
  "comment_context_parallel": "Context Parallel 配置（多 GPU 空间并行）",
  "cp_split_hw": null,
  
  "comment_text_padding": "文本 token 填充方式",
  "text_tokens_zero_pad": true,
  
  "comment_examples": "==== 其他常见配置示例 ====",
  "comment_example_480p_no_bsa": "480p 不使用 BSA: 设置 enable_bsa = false",
  "comment_example_720p_aggressive": "720p 激进 BSA: sparsity = 0.96875 (更稀疏，更快，质量略降)",
  "comment_example_720p_quality": "720p 质量优先: sparsity = 0.875 (较密集，较慢，质量更好)",
  "comment_example_long_video": "长视频: chunk_3d_shape_q/k = [8, 4, 4] (时间维度更大)",
  "comment_example_adaptive": "自适应选择: cdf_threshold = 0.98, sparsity = 0.875 (两者取 max)"
}

